#По двум заданным числам проверить является ли одно квадратом второго 

# a=int(input("Введите число a ="))
# b=int(input("Введите число b ="))

# if a**2 == b:
#     print(f"Число {a} является квадратом числа {b}")
# elif b**2 == a:
#     print(f"Число {b} является квадратом числа {a}")
# else:
#     print("Ни одно из чисел не являются квадратом друг друга")


#Найти максимальное из пяти чисел (Вариант 1)

# a= int(input("Ведите первое число ="))
# b= int(input("Введите второе число ="))
# c= int(input("Введите третье число ="))
# d= int(input("Введите четвёртое число ="))
# e= int(input("Введите апятое число ="))
# max = a
# for i in [b,c,d,e]:
#     if max<i:
#         max=i
# print (f"Максимальное число {max}")



#Найти максимальное из пяти чисел (Вариант 1)
# for i in range (1,6):
#     a=int(input(f"Введите число {i} ="))    
#     if i == 1:
#         max=a
#     elif max<a:
#         max=a
# print (f"Максимальное число {max}")



